-- Заполнение таблиц
INSERT INTO [Специальности] ([Название]) VALUES ("ПОИТ");
INSERT INTO [Специальности] ([Название]) VALUES ("МП");
INSERT INTO [Специальности] ([Название]) VALUES ("АСОИ");
INSERT INTO [Специальности] ([Название]) VALUES ("Биология");

INSERT INTO [Факультеты] ([Название]) VALUES ("Заочный");
INSERT INTO [Факультеты] ([Название]) VALUES ("Математический");
INSERT INTO [Факультеты] ([Название]) VALUES ("Физический");

INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Иванов И.И.", 1, 1, 2);
INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Козлов К.И.", 3, 2, 2);
INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Петров И.К.", 4, 1, 1);
INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Нетров В.В.", 1, 2, 2);
INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Датров И.В.", 2, 3, 3);
INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Ролнов В.К.", 6, 1, 2);
INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Долнов К.К.", 5, 3, 3);
INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Зренов Ж.К.", 3, 2, 2);
INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Жренов К.Ж.", 2, 4, 1);
INSERT INTO [Студенты] ([ФИО], [Курс], [Код специальности], [Код факультета]) 
VALUES ("Есинов И.И.", 4, 4, 1);

INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (1, "Мат.анализ", 8, "Диф.Уравнения", 6, "Экономика", 9, "Психология", 10);
INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (2, "Диф.Уравнения", 10, "Мат.анализ", 8, "Экономика", 7, "Психология", 7);
INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (3, "Мат.анализ", 9, "Диф.Уравнения", 6, "Психология", 5, "Экономика", 5);
INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (4, "ТРПО", 5, "Диф.Уравнения", 7, "Экономика", 8, "Психология", 10);
INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (5, "Психология", 8, "Диф.Уравнения", 6, "Экономика", 9, "ТРПО", 6);
INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (6, "Экономика", 8, "Диф.Уравнения", 7, "Мат.анализ", 8, "Психология", 10);
INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (7, "Диф.Уравнения", 8, "Мат.анализ", 8, "Экономика", 8, "Психология", 8);
INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (8, "Мат.анализ", 4, "Диф.Уравнения", 6, "ТРПО", 10, "Психология", 10);
INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (9, "Мат.анализ", 9, "Физика", 8, "Экономика", 7, "Психология", 6);
INSERT INTO [Сессия] ([Код студента], 
[Предмет 1], [Оценка 1], [Предмет 2], [Оценка 2], 
[Предмет 3], [Оценка 3], [Предмет 4], [Оценка 4]) 
VALUES (10, "Мат.анализ", 9, "Диф.Уравнения", 8, "Физика", 7, "Психология", 6);
