package by.labs.constants;

/**
 * Константы и строковые литералы приложения.
 */
public class Constants {
    
    public static final String ABOUT_MESSAGE_HEADER = 
        "Задание к лабораторной №5";
    
    public static final String ABOUT_MESSAGE = 
        "Разработать ПС с оптимальной структурой данных.\n\n"
        + "Составить программу для нахождения на курсе групп,\n"
        + "в которых учатся студенты, имеющие одинаковые фамилии.\n\n";

    public static final String WINDOW_TITLE = "Lab5";
    
    public static final String BUTTON_TASK = "Задание";
    public static final String BUTTON_ADD = "Добавить";
    public static final String BUTTON_CHECK = "Проверить";
    public static final String BUTTON_RANDOM_GENERATION = "Случайные";
    
    public static final String LABEL_ADD_SURNAME = "Фамилия:";
    public static final String LABEL_ADD_COURSE = "Курс:";
    public static final String LABEL_ADD_GROUP = "Группа:";
    public static final String LABEL_CHECKED_COURSE = "Курс для проверки:";
    public static final String LABEL_NAMESAKES = "Однофамильцы (%d курс):";
    
    public static final String NAMESAKES_EMPTY = "Однофамильцы\nотсутствуют";
    
    public static final String SURNAME_NOT_FILL = "Поле фамилии не заполнено!";
    public static final String WARNING_MESSAGE_HEADER = "Внимание!";
    
    public static final int COURSE_COUNT = 6;
    public static final int NUMBER_GROUPS_ON_COURSE = 5;
    public static final String GROUP_PATTERN = "ПОИТ-%d%d";
    
    public static final int COUNT_RANDOM_SURNAMES = 160;
    
    public static final String[] RANDOM_SURNAME_LIST = new String[]{"Абрамов", 
    "Авдеев","Агафонов","Аксёнов","Александров","Алексеев","Андреев","Анисимов",
    "Антонов","Артемьев","Архипов","Афанасьев","Баранов","Белов","Белозёров",
    "Белоусов","Беляев","Беляков","Беспалов","Бирюков","Блинов","Блохин",
    "Бобров","Бобылёв","Богданов","Большаков","Борисов","Брагин","Буров",
    "Быков","Васильев","Веселов","Виноградов","Вишняков","Владимиров","Власов",
    "Волков","Воробьёв","Воронов","Воронцов","Гаврилов","Галкин","Герасимов",
    "Голубев","Горбачёв","Горбунов","Гордеев","Горшков","Григорьев","Гришин",
    "Громов","Гуляев","Гурьев","Гусев","Гущин","Давыдов","Данилов","Дементьев",
    "Денисов","Дмитриев","Доронин","Дорофеев","Дроздов","Дьячков","Евдокимов",
    "Евсеев","Егоров","Елисеев","Емельянов","Ермаков","Ершов","Ефимов",
    "Ефремов","Жданов","Жуков","Журавлёв","Зайцев","Захаров","Зимин","Зиновьев",
    "Зуев","Зыков","Иванков","Иванов","Игнатов","Игнатьев","Ильин","Исаев",
    "Исаков","Кабанов","Казаков","Калашников","Калинин","Капустин","Карпов",
    "Кириллов","Киселёв","Князев","Ковалёв","Козлов","Колесников","Колобов",
    "Комаров","Комиссаров","Кондратьев","Коновалов","Кононов","Константинов",
    "Копылов","Корнилов","Королёв","Костин","Котов","Кошелев","Красильников",
    "Крылов","Крюков","Кудрявцев","Кудряшов","Кузнецов","Кузьмин","Кулагин",
    "Кулаков","Куликов","Лаврентьев","Лазарев","Лапин","Ларионов","Лебедев",
    "Лихачёв","Лобанов","Логинов","Лукин","Лыткин","Макаров","Максимов",
    "Мамонтов","Марков","Мартынов","Маслов","Матвеев","Медведев","Мельников",
    "Меркушев","Миронов","Михайлов","Михеев","Мишин","Моисеев","Молчанов",
    "Морозов","Муравьёв","Мухин","Мышкин","Мясников","Назаров","Наумов",
    "Некрасов","Нестеров","Никитин","Никифоров","Николаев","Никонов","Новиков",
    "Носков","Носов","Овчинников","Одинцов","Орехов","Орлов","Осипов","Павлов",
    "Панов","Панфилов","Пахомов","Пестов","Петров","Петухов","Поляков",
    "Пономарёв","Попов","Потапов","Прохоров","Рогов","Родионов","Рожков",
    "Романов","Русаков","Рыбаков","Рябов","Савельев","Савин","Сазонов",
    "Самойлов","Самсонов","Сафонов","Селезнёв","Селиверстов","Семёнов",
    "Сергеев","Сидоров","Силин","Симонов","Ситников","Соболев","Соколов",
    "Соловьёв","Сорокин","Степанов","Стрелков","Субботин","Суворов","Суханов",
    "Сысоев","Тарасов","Терентьев","Тетерин","Тимофеев","Титов","Тихонов",
    "Третьяков","Трофимов","Туров","Уваров","Устинов","Фадеев","Фёдоров",
    "Федосеев","Федотов","Филатов","Филиппов","Фокин","Фомин","Фомичёв",
    "Фролов","Харитонов","Хохлов","Цветков","Чернов","Шарапов","Шаров","Шашков",
    "Шестаков","Шилов","Смирнов","Шубин","Щербаков","Щукин","Смирнов","Яковлев"};

}
